{
  "work": {
    "easy": "Объясните, что такое работа силы в физике.",
    "medium": "Рассчитайте работу силы, если сила равна 15 Н, а тело переместилось на 4 м.",
    "hard": "Докажите формулу работы силы при перемещении тела по криволинейной траектории."
  },
  "energy_conservation": {
    "easy": "Что означает закон сохранения энергии?",
    "medium": "Рассчитайте потенциальную и кинетическую энергию тела массой 2 кг на высоте 5 м.",
    "hard": "Объясните применение закона сохранения энергии на примере механической системы с трением."
  },
  "thermodynamics": {
    "easy": "Определите, что такое температура и тепло.",
    "medium": "Рассчитайте количество теплоты, необходимое для нагрева воды массой 0.5 кг на 20 градусов Цельсия.",
    "hard": "Докажите первый закон термодинамики для изобарного процесса."
  },
  "optics": {
    "easy": "Объясните, что такое преломление света.",
    "medium": "Рассчитайте угол преломления, если угол падения равен 30° и показатель преломления среды равен 1.5.",
    "hard": "Опишите явление полного внутреннего отражения и приведите пример его применения."
  },
  "mechanics": {
    "easy": "Что такое сила и как она измеряется?",
    "medium": "Рассчитайте ускорение тела массой 10 кг при действии силы 50 Н.",
    "hard": "Решите задачу на движение тела с переменным ускорением."
  },
  "magnetism": {
    "easy": "Объясните, что такое магнитное поле.",
    "medium": "Рассчитайте силу Ампера, действующую на проводник длиной 0.5 м в магнитном поле с индукцией 0.3 Т.",
    "hard": "Объясните принцип работы электромагнита и его применение в технике."
  },
  "electric_current": {
    "easy": "Что такое электрический ток?",
    "medium": "Рассчитайте сопротивление проводника, если сила тока 2 А, а напряжение 12 В.",
    "hard": "Опишите процессы, происходящие в цепи переменного тока."
  },
  "fluid_mechanics": {
    "easy": "Объясните, что такое давление жидкости.",
    "medium": "Рассчитайте давление на дно сосуда с водой высотой 2 м.",
    "hard": "Опишите закон Архимеда и приведите примеры его применения."
  },
  "quantum_physics": {
    "easy": "Что такое квант и как он связан с энергией?",
    "medium": "Объясните принцип фотоэффекта.",
    "hard": "Рассчитайте энергию фотона с длиной волны 500 нм."
  },
  "newton_laws": {
    "easy": "Перечислите три закона Ньютона.",
    "medium": "Приведите пример применения второго закона Ньютона.",
    "hard": "Решите задачу на движение по наклонной плоскости с учетом сил трения."
  }
}
